[
    {
        "title": "The Suites @ Times Square",
        "reviews": "I recently stayed at The Suites @ Times Square, and it exceeded my expectations. …;Not a Hotel - Stay away!!! Scam!!!\nThis place is not a hotel. It seems like there is a group of Indian Nationals who rented or purchased some apartments in this building and they are trying to …;Stay away!!! NOT recommended!!!\nIt felt like a scam as we entered the lobby. There's no front desk, no place we could sit down, just a couple of Indian guys who came to us and managed …;Amazing trip in most affordable price. Call and nego for the right guy and look for right choice and nego for the best affordable price with Razu +60 16-618 4467;Good hotel staff service. Well-mannered and friendly with kids. Able to play \"pretend\" game with my sons on my first day here working with the concierge staff handling the luggages..my sons totally love it and is able to be more obeidient …;Very nice for living with families. Little bit costly but having so many facilities to stay here. Can enjoy the place at night also. The environment is very neat and clean specialy secure and the staff are also so nice and helping in …;We booked in as a big group and as soon as we arrived at the hotel it took a very long time to organise our rooms. Theres no seating area in the lobby so we sat on the floor as we waited only to be told that we are not allowed to sit on the …;Cons : No telephone, no iron board, no hairdryer, no room slipper, no face towel. Only one access card was provided to each room. One of the lamps in the bedroom was not working. A small part of the parquet floor in the bedroom was …;Definitely one of the better apartment suites. Very reasonable.priced and service is better than most. Not hotel quality service of course but it's there and it's good. …;Really Awesome. But cooking items will get only if u stay more than 15 Days. You can enjoy lowest shopping price shopping. Nice South Indian hotels near by.",
        "id": 1,
        "latitude": "3.142648",
        "longitude": "101.710672",
        "avg_ratings": "4.1",
        "category": "At this place"
    },
    {
        "title": "Geo38 Premier Suites Genting Highlands by MAPLEHOME",
        "reviews": "Trying to be reasonable with this review because it was so mixed. First the positive. The room we ended up staying in was great. Big place, clean with good views as you can see from the video. The location is ok too, easy access to the …;\"First and foremost, if I could give this place zero stars, I would. We had booked a 5-bedroom unit, but upon arrival, we were greeted by a filthy and foul-smelling environment, as if it had been left untouched for an extended period. The …;The apartment is well designed and having windows overlooking a very beautiful mountain view. …;There are 30+floors here but the lift only four and it's small for one, can't really fit more people and we have to wait for a long time for lift when check in and out. And can't even use the staircase they said due to security purpose. We …;It is a service apartment. Modern new building.\n\nA substitute hotel if you want to stay and play at Genting with family. But you …;Had a wonderful stay at the Geo38 Premier Suite in Genting Highlands. The suite was impeccably clean and neat, making me feel comfortable and relaxed throughout my visit. The location was ideal, allowing me to enjoy the beauty of the …;A nice place to stay for a quick rest. Cleanliness is acceptable and facilities are available on daily basis. Strategic location near speedmart, 7e and other restaurants. Just the check in needed to be done at another hotel lobby.;Good\n1. Big Spacious unit\n2. Nice view …;Avoid like the plague\n\nThe attitude of the staff is really bad. Had me move into a room and few hours …;*Geo 38 Premium King Suites* provided an outstanding three-day, two-night stay that merits commendation. We checked in seamlessly at 3 pm, appreciating the efficient process. Kudos to Ms. Wani, an exceptionally attentive and friendly …",
        "id": 1,
        "latitude": "3.38702",
        "longitude": "101.776226",
        "avg_ratings": "3.9",
        "category": "At this place"
    },
    {
        "title": "The Place @ Cyberjaya",
        "reviews": "",
        "id": 1,
        "latitude": "2.9372015",
        "longitude": "101.6623624",
        "avg_ratings": "3.7",
        "category": "At this place"
    },
    {
        "title": "D PLACE CAFE",
        "reviews": "Prawn sambal with petai and the sambal serve with nasi goreng kampung was very nice. Sambal alone reminds me of sambal nasi lemak, and its very tasty and like the spiciness. I wish i could taste the nasi lemak, too bad its no longer available on the menu.;Fish and chip, fish was damn dry and overcooked.. spaghetti aglio olio was like worse, too much of herbs.. was bitter.. like no point",
        "id": 1,
        "latitude": "2.9371265",
        "longitude": "101.6621411",
        "avg_ratings": "3.7",
        "category": "At this place"
    },
    {
        "title": "T Place Kopitiam",
        "reviews": "The pork rib noodle was labelled recommended. It's super normal and tastes like home when we mix the black soy sauce and fried onion oil. The black soy sauce is too strong, beside that I can’t taste any others! If you are looking for a …;#sunday #foodspotting\nToday, we landed ourselves for #lunch in\nT Place #kopitiam …;Clean and comfortable kopitiam for decent food. They offer meehunkueh, claypot yee mee, nasi lemak, fried noodles, asam laksa and dim sum. We tried their claypot yee mee, nasi lemak, fried carrot cake and cham iced, portions were huge and …;We went for dinner. New chef with 30 years experience .. just started\ntheir business 3 weeks ago.  Nice food , clean and comfortable. Price reasonable. Definitely will come again;Very good place to have breakfast. Tasty soft boiled egg. The environment and service justified for the price. Probably need a more shining sign board to attract neighbouring residents to explore the gem.;Excellent, attentive service. Good place to bring kids. Clean, well kept, even toilets are spotless. Despite the higher pricing I felt comfortable bringing my kids here. The drinks i.e. Hor ka sai are good & inexpensive. Menu quite …;By far the best asam laksa I had in town. Soup is so thick and tasty. Kopi ice have some room of improvement.;The food is overpriced for the portion.\n\nOrdered prawn mee, cost RM12 and the portion is so small and it taste diluted. …;Bad experience. Roasted pork rice and only with belly 🫡\n\nDrinks is not hot. Price is over. 🫣 …;Ordered pan mee and it turns out quite normal. Food was below average and the drinks served was tasteless. Price is overrated. You can easily get better quality food with this price range around this livelihood. First visit here, definitely not recommend it.",
        "id": 1,
        "latitude": "2.9467692",
        "longitude": "101.5431988",
        "avg_ratings": "3.7",
        "category": "At this place"
    },
    {
        "title": "Klinik Pergigian Dental Place Cyberjaya",
        "reviews": "the best dental clinic so far, the doctor and staff really friendly. im done with scalling and polishing, maybe after this im going to do another treatment at dental place clinic 🤩 the clinic also provided parking for the patient and its very easy to park our car. thank you dental place !! i really enjoy the moment !!!🥰 …;The best dental clinic so far 😍Immediately became my favourite dentistry. Im done with scalling and polishing, the dentist herself is such a nice, honest, soft-spoken lady.Even the staffs are very, very nice & friendly ! Will come here for …;Did my scaling and polishing here at this clinic and i am satisfied with their service. Beautiful interior, reasonable price and not to mention, the staff and doctor were nice as well. Recommended!;Went there for polishing and scaling and had the best experience over here. Professional, friendly and soft spoken doctor along with her assistant which makes it easy for someone who's not comfortable going to a dentist. Reasonable price …;Had the most unpleasant experience here. A friend chipped his tooth and we went to this clinic to get it bonded but the Doctor wasn't even bothered to look at the remaining piece of tooth to be attached. Immediately said that we have to …;Went here for a hole in my tooth, the dentist was really nice and gentle, didnt feel too much pain as i feared, just booked an appt for scaling :);Immediately became my favourite dentistry. Went here for braces consultation and the dentist herself is such a nice, honest, soft-spoken lady. She gave easy explanation that a non-medical person like me to understand properly. Even the …;Excellent services. Nice place. Reserve parking available.;Good service,Dr.very friendly, klinik yang selesa..thank you Dental Place👍will come again. …;The clinic, doctor & staffs are very kids friendly. Love the clinic’s ambience.\nSurely will be our family’s dental clinic.",
        "id": 1,
        "latitude": "2.9233233",
        "longitude": "101.6607139",
        "avg_ratings": "4.8",
        "category": "At this place"
    },
    {
        "title": "Restoran Patin Place",
        "reviews": "I love the Malay style food here. Full of wok Hei and authentic taste. Atmosphere is comfortable and the staffs are friendly too.;Best tempoyak I ever had and not surprisingly it's owned by Chinese. The standard of food here is great n very authentic Malay style.\nFamily run, Very friendly owner n staff. …;Been staying in puchong for 3 years, first time come across this restaurant. Me and my husband were blown away by the patin tempoyak. It was really nice! We ordered tempoyak dua rasa and kailan hongkong if I'm not mistaken. It was so …;Was alone having dinner & tried Dry Steamed Patin Tempoyak topped with smelly beans aka petai.\nThis is a real game changer in tempoyak dish. Recommended a must try dish.\nThe prawn broccoli is really nicely stir fried with the freshness of the prawn;Everything was delicious, home cooked feel but the deep fried kangkung was weird bland and pricey.;First time here purposely for 2022 Iftar with my beloved family. Honestly your menu and taste are mind blowing. It is exceeded my family expectation. …;Visited here again and again as the food is really satisfying. Nasi goreng temerloh, their signature patin tenpoyak are all indulging. Highly recommended;The food here was amazing, the saur mango sauce so yummy and open my appetite. The fried vege super yummy too. 🤤 …;Owner and staffs are from state of Pahang, they’re all very warm and friendly and they ensure top notch customers service. Food is delicious and very authentic. Price is reasonable, worth every penny, fresh and tasty. Restaurant is …;Recommended!!! It was my first time bringing my whole family members, total of 11 persons including two of my friends, dining here and including two of my younger brothers celebrating their birthdays here too! Seriously, the staffs very …",
        "id": 1,
        "latitude": "2.9922879",
        "longitude": "101.6213985",
        "avg_ratings": "4.4",
        "category": "At this place"
    },
    {
        "title": "Home place Yati",
        "reviews": "Place to eat with fast serve..;There are many restaurants;𝘈𝘭𝘭𝘭 𝘪𝘯 𝘪𝘯𝘪 …;Best 👍 …;your gg",
        "id": 1,
        "latitude": "3.034354",
        "longitude": "101.411315",
        "avg_ratings": "3.8",
        "category": "At this place"
    },
    {
        "title": "The Palace Place",
        "reviews": "beautiful",
        "id": 1,
        "latitude": "3.1385059",
        "longitude": "101.6869895",
        "avg_ratings": "5.0",
        "category": "At this place"
    },
    {
        "title": "A-Park",
        "reviews": "Such a wise decision choosing this venue! Suits for a private wedding garden theme. Really comfortable for family members. There are few homestays too. The environment is soooo good Ma Shaa Allah. Love it 😍 …;Been to the other space, and this is as great as the other one (The Square). Open space hall with ample parking and water surrounding the hall;Came to A Park for our neighbor's son's wedding, but stayed for all the fun trams, buggies and boat rides! Guests will find events here memorable. …;Very nice & cozy place. Attending my friends daughter wedding...;The park is definitely a great to organise events e.g. wedding ceremony, family day, etc.;Above average event place deep in the heart of pulau meranti.\n\nPark your car and wait for a buggy or tram to pick you up and bring you to the …;Went for a friend's daughter's wedding reception, got a tour of the whole grounds including the 2 cottages. Very well done- Comfortable for the families to prepare for the wedding there. A bit out of the way location, but once inside you're all set.;Car park is available opposite the site event. The crew provide a golf buggy for those opt for it from the car park to the event place (no need to walk). Very beautiful garden wedding site. Make sure to wear white for a beautiful picture moment :D;Attended wedding ceremony here with both Mom and Dad and they was really excited to meet Mak Nah and her families.\nIm glad i was here sharing the moments and creating memories by meeting all the …;With the concept of a wedding in the garden or 'Garden Wedding' and bouquate hall, A park has been fully operational many years ago. …",
        "id": 1,
        "latitude": "2.9644627",
        "longitude": "101.6317197",
        "avg_ratings": "4.4",
        "category": "At this place"
    },
    {
        "title": "African Food Palace Amala joint",
        "reviews": "The best place for African food. Pricing is on the high end, but it's so worth it. Amala is the softest I've ever had, roundabout clean and juicy, portions are big and filling. Owner is very friendly and welcoming.;The food was delicious and as someone tasting African food for the first time, it's remarkable. …;Thumbs Up for African Food Palace - Amalia Joint!\n\nWe Had an amazing time at African Food Palace - Amalia Joint! Delicious African cuisine, great vibes, and friendly staff. Highly recommend!;Very good and tasty food for the price. Very good and friendly service. Highly recommended for African food;Best african(nigerian) food in malaysia located in cyberjaya . Not to miss the jollof rice and awesome egusi soup . A must try for all crave for new cuisine malaysians . HALAL african cuisine . Warmest and most humble welcome by the chef Madam Maryam . Shall repeat !;It was simply amazing! Their service, food and the relaxed ambience was 💯 10/10 would recommend it 😊 …;love to eats african food even not remember the name😅but the staff n madam really helpful to help me order..craving satisfied 👍👍good job #africanfoodtakeaway …;I enjoy everything about this place. I would like to recommend you to experience African meals at this place. It's a pure African dishes and you get what you paid. I assume myself of not only pay to eat, but also pay to enjoy the culture and tradition through food.;I've ordered a number of times, food has always been consistently good and made with love. Heartwarming comfort food. Owner is very friendly and warm. Food portion is large, and fulfilling- for those who thinks it's pricey- it's definitely worth it!;Im a big fan of African food and it's not easy to find halal ones. If you are looking to try a delicious African cuisine, this is where you go",
        "id": 1,
        "latitude": "2.9370558",
        "longitude": "101.6622415",
        "avg_ratings": "4.8",
        "category": "At this place"
    },
    {
        "title": "A-Saloon Main Place - Highly Recommended Best Salon in USJ",
        "reviews": "Friendly and helpful staff. Cozy atmosphere. Highly recommend hair stylist Brandon if you aren't sure who to look for. He is the only stylist i wholeheartedly trust to do it all with my hair. …;Exceptional Saloon Experience!\n\nI am beyond thrilled by the outstanding services provided here.The ambience was …;What more we need to say for both Brandon and soon Lee. Their services is optimum.  Polite to customers and having sense of humour. They don't exaggerate their haircut prices.  We love this place even though its our 1st experience and we …;Constantly coming over to this saloon. Previously i'm always going to random saloons however after I had my haircut by Senior Stylist - Brandon, i've been coming here every month / every other month to get my haircut. He's really …;service was great. i did bleaching, colouring and hair treatment with hairstylist Brandon. highly recommend!;bad hair day\n\nafter seeing so many nice review i have decided to give a try. But it turned out …;Really good service and friendly. Soon Lee provided a lot of recommendations and helped with finding a suitable haircut. They were gentle and not rough with the service as well. Recommend to go here :);Service was nice, I coloured my hair, half black half red, until now the red is still prominent, I have already washed 3 times with normal shampoo and the colour has not faded yet. Though I'm not sure if it was the bleach or they didn't wash my hair properly, my hair was itchy. It could be the bleach and dye.;My second time here. The saloon has a very nice ambiance. Friendly, polite, welcoming and highly skilled hairstylists. Totally transformed my hair with just a haircut. I look like a new person now 😉 thank you for the amazing service. Highly recommended 👍👍👍💯💯💯 …;My current favourite salon - did relaxing in May and then, hair and scalp treatment in November. Will visit again soon for relaxing touch up. I always have a great time here. …",
        "id": 1,
        "latitude": "3.0265771",
        "longitude": "101.5811881",
        "avg_ratings": "4.9",
        "category": "At this place"
    },
    {
        "title": "U-Thant Place",
        "reviews": "Design was amazing..;Good.",
        "id": 1,
        "latitude": "3.1568074",
        "longitude": "101.7231712",
        "avg_ratings": "4.4",
        "category": "At this place"
    },
    {
        "title": "The Eye Place Optometrist Kota Kemuning",
        "reviews": "Very good service! They provided a very detailed health check for my eyes which not every optometrist will provide. Definitely recommend to everyone who reading this comment😊 Do remember to make appointment before coming🤓 …;Thank you to William, the optometrist. His explanation was good and very helpful. The service is appropriate, he's very polite and considerate, does not try to upsell unnecessary things. He has good experience in his line. …;I had a fantastic experience at this optical store! The staff was incredibly friendly and knowledgeable. What impressed me the most was their state-of-the-art high-technology tests, and the best part is they offer them for free. It's clear …;This place clearly lives up to their 5-Star rating. Optometrist Wong was amazingly helpful. His professionalism, knowledge, and service were just immaculate. We learnt so much from his thorough explanation of our eye test. We never knew …;Our first experience here & the optometrists working here did not fail us. They did multiple eye checks with machines and manual assessments to determine the health of our eyes inside and out, eye muscle health & vision focusing to …;This is the 1st time I visited The Eye Place Optometrist .I am beyond impressed with the exceptional service I received. …;Very helpful n friendly optometrist.\nWell explained on every checking terms n results. Proffesional service;This is my first reading glasses and I am impressed with the details, useful tips & guides shared by “Mr Wang”. Really have great experience with friendly and professional services he did. Very trustable optical shop and he suggested the …;A great place and professional team to help me;Excellent service from William. I was very impressed by his knowledge and his willingness to help. It turns out I don't urgently need glasses yet and I was surprised that he wasn't pushy to make sales. Very impressive. His colleague then …",
        "id": 1,
        "latitude": "3.005064",
        "longitude": "101.5351756",
        "avg_ratings": "5.0",
        "category": "At this place"
    },
    {
        "title": "Main Place Mall USJ",
        "reviews": "Stay in airbnb on top of main place. Convenient access to mall, and other facilities. Will get lost finding residence car park for the first time;Nice mall with most of the shoping outlet in klang vally, experiences includes Branded Outlet, Uni Clo different restaurents specially Nandos. Popular book shop is also here.;Enough of everything that a mall is supposed to have, but you wouldn't specifically want to go there for anything, except if you lived in that area. Some food options, which are all the usual ones. The Shell Out place looks ok, but a bit on the pricy side unless you have their set lunches on weekdays.;I wish I could leave the stars out of this review still because the drink was not that bad so I gave 1 star. And to be fair although there was no change for RM50 when paying as the friendly cashier didnt have enough cash, the service was …;A quiet mall which have most of the well known stores inside like jaya grocer, DIY, Nam Heong, McD and more. It is clean and does not feel like a dead mall eventhough most of the store havent been rent out.;This mall is complete with all the branded brands, good supermarket ( Jay Grocer ) and a lot of restaurant, cafe and fast food for patrons to choose from. The parking space was ample too..really recommended for visitor who are staying around the mall.;One of the most frequent malls I go into to get my weekly needs.\n\nBookshop …;Main Place is not a grand mall but it's a place where u can find your needs and quite good to hang out.. there's a various food outlet, and of course they have Popular, Uniqlo and Brand Outlet as well and the best of all, Jaya Grocer.. Easy access from/to Puchong, Subang Jaya, Shah Alam;Most of the restaurants are available for take away only. Only few are ready for dine in. The toilet well maintained and clean. The jaya grocer here has more choices and pre-cut vegetables. Overall not a big mall but a good place to shop for most of the essential needs.;Sushi Zanmai's the best !  Thanks for te great level of service and assistance, super crew 👍 …",
        "id": 1,
        "latitude": "3.02632",
        "longitude": "101.5811466",
        "avg_ratings": "4.1",
        "category": "At this place"
    },
    {
        "title": "Molly Fantasy @ Main Place",
        "reviews": "There is unlimited play for half an hour and 1 hour promotion, which for me is worth spending for active kids like mine.;Best place to bring kids to play. They have little play rooms like kitchen, clinic, groceries store and slides with balls. The entrance fee is cheap and afforable. Staffs always monitoring and arranging back the messed toys so it was easier …;I loved this place due to following reasons:\n1. Entrance fee is a way cheaper, can’t recall the exact fee but less than 20 per child. …;Bring my daughter and son to play here..affordable price. All the item is well kept and clean..you must sanitize your hands before go in..the sanitizer provided by the staff..very nice.;Half of the games are outside the shop, at the kiosk area. Has a small play area for kids and it's cheaper than others.;My family favorite place... Really recommend its so Fun, clean and safe area;I love to come here once in a while (twice a week) but the only thing they have is Pokémon Ga Ole and basketball that is up-to-date with current arcade games. I really hope that they will add more updated arcade games such as Taiko and Wangan. I'm sure it will bring fortune to the arcade and Im sorry to give only 3 star.;First i would like to complain about all the gaole pokemon machine is all broken none of them is working, and my purpose to come is to play the gaole machine, and i don't know is broken so i scanned it and guess what no refund for me, so i …;Lots of game options to play, great package deals, friendly and helpful workers. Overall best molly fantasy yet;Hopes the arcade machine is variety.\nThis is the place for children and adults to release tension.",
        "id": 1,
        "latitude": "3.0265299",
        "longitude": "101.581059",
        "avg_ratings": "4.1",
        "category": "At this place"
    },
    {
        "title": "Nam Heong Chicken Rice, Main Place Mall",
        "reviews": "Hey Solarance again and here I am now after a long workout I decided to have lunch @ Nam Heong Chicken Rice in Mainplace. Well, I defo have a few things to say about the food here so let’s get on it~ …;First time here. Compared to other outlets, this is small with limited tables and seats. Place nice and clean, service is good. Ordered Dry BBQ Chciken Egg Noodles, the taste is good but did not expect the portion so small. With the price …;Great experience! Awesome service by all the staff especially named Syuan (hope i spelled it correctly). Food was simple and clean. Cant really say authentic as i myself dont know the original taste but overall was fantastic. Had the …;Nam Heong has it all. Even tho this restaurant is tucked away in a corner of the basement of Main place, I enjoyed my dijing experience there.  Firstly, the food... I enjoyed the butter chicken rice. It was very flavourful especially when …;Their personal meal - roasted chicken rice set was pretty well priced, lots of meat and also seasoned butter rice.\nThe curry chicken, however, can be improved. Basically it’s not chicken cooked …;Food is good as many reviews before.\nThe soup that comes with chicken rice, brings back the taste of chicken rice of the olden days ❤️ …;Halal place.\n\nrm20 for mix roast chicken and bbq chicken. I really liked the chicken rice dark soy sauce that they have at the table. Yum! Their chili sauce and ginger was just so so.;A small cosy restaurant at Main Place mall to hang out with small group of friends if you manage to grab the sofa seats. …;Loved the dry wantan noodles with bbq chicken. The noodles were springy and the chicken was tender and juicy. The bean sprouts were faily crunchy and fleshy too. …;1st time to here. Cozy enviroment with comfort foods. Excellent foods. The sour spicy vegetable was simple mouth watering. The President Kaya Butter Toast was perfectly perfect with huge slice of butter in between the Kaya! Love it! Will definitely come back again !",
        "id": 1,
        "latitude": "3.0269363",
        "longitude": "101.5815052",
        "avg_ratings": "4.4",
        "category": "At this place"
    },
    {
        "title": "Papamama western place",
        "reviews": "Found this place from facebook. Cosy setup and practical.\n\nRight beside dapor che ta. Only selling limited western food. Hot food and …;The food was excellent with reasonable price. Recommended restaurant for western and italian spaghetti's variety.;Alhamdulillah thank you...;#LuPaduLuMari",
        "id": 1,
        "latitude": "2.9397944",
        "longitude": "101.5840973",
        "avg_ratings": "4.8",
        "category": "At this place"
    },
    {
        "title": "ThatNicePlace",
        "reviews": "This is my second visit to this place. This time we stayed in The Loft. and previously at La Bella and The Gem. That Nice Place offers a serene and quiet retreat, making it a perfect getaway destination. The surroundings create a tranquil …;Thanks to Irene and team for seamless booking and attention to detail. The Grey House was quaintly decorated and cozy. Downside to the unit was the dark stairways with cats' urine and noise outside (from traffic and cats till late at …;Very beautiful place. The staff is so nice, especially Irene, that help and guide us all the time for everything. The unit is very nice and quiet with an amazing view. The location is also good and 25 minutes to KL, and there are many shopping areas around here.;It was a pleasant stay with host being very helpful. The apartment is clean well kept.\nIt would be good for a floor mat to be included at the front entrance.\nOverall its a good, comfortable space for a family staycation;Nice cozy place. Irene was pleasant and welcoming. she made an extra special touch by adding a play tent for my toddler.  He loved it. We stayed at the duck house, it was clean and comfortable. We will definitely recommend thatniceplace.;A very homey and cosy house. We received a warm welcome from Irene, she even baked us Christmas cupcakes. She is very helpful and responsive. Overall, we enjoyed our stay at The Sabbath.;Us four women enjoyed our reunion in the comfortable, well presented interior with lovely little aesthetic touches, and gorgeous views which is Green Rhapsody. All in the party were happy and we would come back again! We really appreciated …;The Duck Place at That Nice Place was clean with every amenity provided. The decor was tasteful. We could hear a stream running in the distance; the sound of which was refreshing and soothing. Of course, since it is at Selesa Homes, it's …;It was such a delight to stay here. Our church had an overnighter, and it was a wonderful stay- rooms were cosy, and clean. The host, Irene, was very helpful. There were 37 of us and she helped us prepare dinner and breakfast too. It's a refreshing place to stay if you are looking for a venue for retreat.;Rooms were clean and tidy, located with good mountain view. Was a comfortable stay. Ms.Irene is a wonderful host and ensured our stay was pleasant!",
        "id": 1,
        "latitude": "3.3555001",
        "longitude": "101.8215019",
        "avg_ratings": "4.9",
        "category": "At this place"
    }
]